nxp-mcuxpresso/mcuxsdk-examples/_boards/twrkm35z75m/common/pin_mux/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitINFRA_REDPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitINFRA_REDPins(void)
{
    /* PCTLD Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* PCTLL Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortL);
    /* Peripheral Crossbar Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_Xbar);

    const port_pin_config_t IR_RX = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Open drain is disabled */
                                     kPORT_OpenDrainDisable,
                                     /* Pin is configured as CMP0_IN0 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTD0 (pin 61) is configured as CMP0_IN0 */
    PORT_SetPinConfig(BOARD_IR_RX_PORT, BOARD_IR_RX_PIN, &IR_RX);

    const port_pin_config_t IR_TX = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Open drain is disabled */
                                     kPORT_OpenDrainDisable,
                                     /* Pin is configured as XBAR_OUT10 */
                                     kPORT_MuxAlt2,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTL2 (pin 129) is configured as XBAR_OUT10 */
    PORT_SetPinConfig(BOARD_IR_TX_PORT, BOARD_IR_TX_PIN, &IR_TX);

    SIM->MISC_CTL = ((SIM->MISC_CTL &
                      /* Mask bits to zero which are setting */
                      (~(SIM_MISC_CTL_UARTMODTYPE_MASK | SIM_MISC_CTL_UART0IRSEL_MASK)))

                     /* UART Modulation Type: TypeB (AND'ed) Modulation selected for IrDA. */
                     | SIM_MISC_CTL_UARTMODTYPE(MISC_CTL_UARTMODTYPE_0b1)

                     /* UART0 IrDA Select: UART0 selected for IrDA modulation.
                      * UART0 TX modulated by XBAR_OUT[14] and UART0 RX input connected to XBAR_OUT[13].
                      * UARTxIRSEL cannot configure XBAR_OUT[14] and XBAR_OUT[13] automatically, and they need
                      * extra configuration in XBAR.
                      * User should configure XBAR[14:13] accordingly. */
                     | SIM_MISC_CTL_UART0IRSEL(MISC_CTL_UART0IRSEL_0b1));
    /* UART TX Output (after modulation) output assigned to XBAR_IN14 input is connected
     * to XBAR_OUT34 output assigned to XBAR Output pin 10 */
    XBAR_SetSignalsConnection(XBAR, kXBAR_InputUartTxOutput, kXBAR_OutputXbOut10);
    /* CMP0 Output output assigned to XBAR_IN11 input is connected
     * to XBAR_OUT13 output assigned to UART Rx IrDA Input */
    XBAR_SetSignalsConnection(XBAR, kXBAR_InputCmp0Output, kXBAR_OutputUartRxInput);
    /* iRTC Clock Output output assigned to XBAR_IN10 input is connected
     * to XBAR_OUT14 output assigned to SIM UART Tx IrDA Modulator Carrier Input */
    XBAR_SetSignalsConnection(XBAR, kXBAR_InputRtcClockOutput, kXBAR_OutputUartTxModCarrier);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPOTENTIOMETERPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '95', peripheral: ADC0, signal: 'SE, 8', pin_signal: LCD_P0/ADC0_SE8/CMP2_IN4/PTF1/QTMR0_TMR0/XBAR_OUT6, slew_rate: no_init, open_drain: no_init, pull_select: down,
    pull_enable: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPOTENTIOMETERPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPOTENTIOMETERPins(void)
{
    /* PCTLF Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortF);

    /* PORTF1 (pin 95) is configured as ADC0_SE8 */
    PORT_SetPinMux(BOARD_ADC_POT_PORT, BOARD_ADC_POT_PIN, kPORT_PinDisabledOrAnalog);

    PORTF->PCR[1] = ((PORTF->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pulldown resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | PORT_PCR_PS(kPORT_PullDown)

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitTEMP_SENSORPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '96', peripheral: ADC0, signal: 'SE, 9', pin_signal: LCD_P1/ADC0_SE9/CMP2_IN5/PTF2/CMP1_OUT/RTC_CLKOUT, slew_rate: no_init, open_drain: no_init, pull_select: down,
    pull_enable: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

